import cv2
import pytesseract as pt
from marks import find_marks
from get_text import get_values
import os
pt.pytesseract.tesseract_cmd = r'D:\Tesseract\tesseract.exe'

info = {}
for x in os.listdir():
    if x.endswith("_1a.jpg"):
        image = cv2.imread(x)
        info['shifr'] = pt.image_to_string(image[240:330, 470:880], lang='rus')
        info['inv'] = pt.image_to_string(image[250:330, 1230:1780], lang='rus')
        info['num'] = pt.image_to_string(image[310:440, 470:880], lang='rus')
        info['num_col'] = pt.image_to_string(image[320:450, 1230:1780], lang='rus')
        info['author'] = pt.image_to_string(image[430:530, 470:], lang='eng+rus')
        info['face'] = pt.image_to_string(image[520:680, 470:], lang='rus')
        info['name_dr'] = pt.image_to_string(image[660:830, 470:], lang='eng+rus')
        info['name_note'] = pt.image_to_string(image[800:900, 470:], lang='eng')
        info['descr'] = pt.image_to_string(image[880:1040, 470:], lang='rus')
        info['place'] = pt.image_to_string(image[1020:1120, 460:1250], lang='rus')
        info['year'] = pt.image_to_string(image[1040:1140, 1810:], lang='eng')
        info['notes'] = find_marks(image, {'+': [1100, 1200, 460, 700]})
        info['stamp'] = find_marks(image, {'+': [1100, 1200, 1050, 1250]})
        info['orig_stamp'] = find_marks(image, {'+': [1100, 1200, 460, 700]})
        info['records'] = find_marks(image, {'+': [1120, 1220, 2190, "-"]})
        info['notes_descr'] = pt.image_to_string(image[1180:1530, 460:], lang='eng+rus')
        info['expos'] = find_marks(image, {'+': [1500, 1600, 460, 690]})
        info['expon'] = pt.image_to_string(image[1510:1620, 1050:1830], lang='eng')
        info['cop'] = find_marks(image, {'+': [1520, 1620, 2190, "-"]})
        info['comment'] = pt.image_to_string(image[1590:2040, 1:], lang='eng+rus')
    elif x.endswith("_1b.jpg"):
        image = cv2.imread(x)
        info['size_base_length'] = get_values(image[2000:2090, 600:800], 'num')
        info['size_base_width'] = get_values(image[2000:2090, 970:1190], 'num')
        info['size_mont_length'] = get_values(image[2060:2150, 600:800], 'num')
        info['size_mont_width'] = get_values(image[2060:2150, 970:1200], 'num')
        info['krep'] = get_values(image[2000:2090, 1550:], 'text')
        info['back'] = get_values(image[2070:2170, 2210:], 'num')
        info['img_technique'] = find_marks(image,
                                           {'Оригинальная': [2355, 2455, 540, 640], 'Печатная': [2420, 2515, 540, 640]})
        info['text_technique'] = find_marks(image, {'Печатный текст': [2355, 2455, 1110, 1210],
                                                    'Рукописный текст': [2415, 2515, 1110, 1210]})
        info['base_material'] = find_marks(image, {'Бумага': [2355, 2455, 1685, 1785],
                                                   'Бумага верже': [2415, 2515, 1685, 1785],
                                                   'Пергамен': [2475, 2575, 1685, 1785],
                                                   'blank': [2535, 2635, 1685, 1785],
                                                   'Наличие водяных знаков': [2595, 2695, 1685, 1785]})
        info['mont_material'] = find_marks(image,
                                           {'Бумага': [2360, 2460, 2255, '-'], 'Бумага новая': [2430, 2530, 2255, '-'],
                                            'Картон': [2485, 2585, 2245, '-'],
                                            'Бумага оригинальная': [2535, 2635, 2255, '-'],
                                            'Наличие водяных знаков': [2595, 2695, 2255, '-']})
        info['img_material'] = find_marks(image, {'Минеральные краски': [2775, 2855, 560, 660],
                                                  "Медные краски": [2835, 2905, 560, 660],
                                                  "Жел.-галл. чернила": [2895, 2970, 560, 660],
                                                  "Чернила": [2955, 3025, 560, 660],
                                                  "Цветной карандаш": [3015, 3080, 560, 660],
                                                  "Графитовый карандаш": [3070, 3140, 560, 660],
                                                  "Тушь": [3130, 3200, 560, 660],
                                                  "Печатная краска": [3190, 3260, 560, 660],
                                                  "blank": [3250, 3320, 560, 660]})

        info['text_material'] = find_marks(image, {'Печатная краска': [2760, 2860, 1120, 1215],
                                                   'Жел.-галл. чернила': [2830, 2930, 1120, 1215],
                                                   "Чернила": [2890, 2990, 1120, 1215],
                                                   "Современные чернила": [2945, 3045, 1120, 1215],
                                                   "Цветной карандаш": [3000, 3100, 1120, 1215],
                                                   "Графитовый карандаш": [3060, 3160, 1120, 1215],
                                                   "Тушь": [3120, 3220, 1120, 1215],
                                                   "blank": [3180, 3280, 1120, 1215], "blank": [3240, '-', 1120, 1215]})
        info['note_front_material'] = find_marks(image, {"Жел.-галл. чернила": [2765, 2865, 1685, 1785],
                                                         "Современные чернила": [2825, 2925, 1685, 1785],
                                                         "Химический карандаш": [2885, 2985, 1685, 1785],
                                                         "Цветной карандаш": [2945, 3045, 1685, 1785],
                                                         "Графитовый карандаш": [3005, 3105, 1685, 1785],
                                                         "Штампы": [3065, 3165, 1685, 1785],
                                                         "Тушь": [3125, 3225, 1685, 1785],
                                                         "Чернила": [3185, 3285, 1685, 1785],
                                                         "blank": [3245, "-", 1685, 1785]})
        info['note_back_material'] = find_marks(image, {"Жел.-галл. чернила": [2765, 2865, 2255, "-"],
                                                        "Современные чернила": [2830, 2930, 2255, "-"],
                                                        "Химический карандаш": [2890, 2990, 2255, "-"],
                                                        "Цветной карандаш": [2950, 3050, 2255, "-"],
                                                        "Графитовый карандаш": [3010, 3110, 2255, "-"],
                                                        "Штампы": [3070, 3170, 2255, "-"],
                                                        "Тушь": [3130, 3230, 2255, "-"],
                                                        "Чернила": [3190, 3290, 2255, "-"],
                                                        "blank": [3240, "-", 2255, "-"]})
    elif x.endswith("_2.jpg"):
        image = cv2.imread(x)
        info['defects_phys'] = {"Деформация": get_values(image[265:365, 220:315], 'num'),
                                "Утраты": get_values(image[325:425, 220:315], 'num'),
                                "Разрывы": get_values(image[385:485, 220:315], 'num'),
                                "Заломы": get_values(image[445:545, 220:315], 'num'),
                                "Разрушение": get_values(image[505:605, 220:315], 'num'),
                                "Ломкость": get_values(image[565:665, 220:315], 'num'),
                                "Проколы": get_values(image[625:525, 220:315], 'num'),
                                "Фоксинги": get_values(image[265:365, 665:765], 'num'),
                                "Пятна": get_values(image[325:425, 665:765], 'num'),
                                "Затёки": get_values(image[385:485, 665:765], 'num'),
                                "Изменение цвета": get_values(image[445:545, 665:765], 'num'),
                                "Срывы, потёртости": get_values(image[505:605, 665:765], 'num'),
                                "blank_1": get_values(image[565:665, 665:765], 'num'),
                                "blank_2": get_values(image[645:745, 665:765], 'num'),
                                "Степень повреждения": get_values(image[675:775, 660:830], 'num'),
                                "Оценка повреждений": get_values(image[735:835, 660:830], 'num')}
        info['defects_microb'] = find_marks(image, {"Биологическая пигментация": [315, 415, 1465, 1565],
                                                    "Колонии микромицетов": [375, 475, 1460, 1560],
                                                    "Биологическое разрушение": [435, 535, 1460, 1560],
                                                    "Нет микробиологических повреждений": [495, 595, 1460, 1560],
                                                    "blank_1": [555, 655, 1460, 1560],
                                                    "blank_2": [615, 715, 1460, 1560]})
        info['defects_microb_st'] = get_values(image[675:775, 1460:1630], 'num')
        info['defects_microb_ots'] = get_values(image[735:835, 1460:1630], 'num')
        info['defects_entom'] = find_marks(image, {"Личиночные ходы": [315, 415, 2195, 2295],
                                                   "Экзувии/Засиды": [375, 475, 2195, 2295],
                                                   "Личинки/Имаго": [435, 535, 2195, 2295],
                                                   "Нет энтомологических повреждений": [495, 595, 2195, 2295],
                                                   "blank_1": [555, 655, 2195, 2295],
                                                   "blank_2": [615, 715, 2195, 2295]})
        info['defects_entom_st'] = get_values(image[675:775, 2130:2300], 'num')
        info['defects_entom_ots'] = get_values(image[735:835, 2130:2300], 'num')
        info['img_paint_defect'] = find_marks(image, {"Истирание": [1250, 1350, 730, 830],
                                                      "Осыпание": [1310, 1410, 730, 830],
                                                      "Растрескивание": [1370, 1470, 730, 830],
                                                      "Другое": [1430, 1530, 730, 830],
                                                      "blank_1": [1485, 1585, 730, 830]})
        info['img_paint_defects_st'] = get_values(image[1545:1645, 730:830], 'num')
        info['img_paint_defects_ots'] = get_values(image[1605:1705, 730:830], 'num')
        info['img_text'] = find_marks(image, {"Прохождение чернил": [1250, 1350, 1450, 1550],
                                              "Растекание чернил": [1310, 1410, 1450, 1550],
                                              "Угасание": [1365, 1465, 1450, 1550],
                                              "Выпадение строчных мест": [1425, 1525, 1450, 1550],
                                              "Другое": [1485, 1585, 1450, 1550]})
        info['img_text_st'] = get_values(image[1545:1645, 1450:1550], 'num')
        info['img_text_ots'] = get_values(image[1605:1705, 1450:1550], 'num')
        info['img_paint'] = find_marks(image, {"Красками": [1250, 1350, 2255, "-"],
                                               "Железо-галловыми чернилами": [1300, 1400, 2255, "-"],
                                               "Другое": [1360, 1460, 2255, "-"],
                                               "blank_1": [1420, 1520, 2255, "-"],
                                               "blank_2": [1480, 1580, 2255, "-"]})
        info['img_paint_st'] = get_values(image[1540:1640, 2255:], 'num')
        info['img_paint_ots'] = get_values(image[1540:1640, 2255:], 'num')

    elif x.endswith('_3.jpg'):
        image = cv2.imread(x)
        info['conserv'] = find_marks(image, {"Дезинфекция задано": [225, 325, 480, 660],
                                             "Дезинфекция выполнено": [225, 325, 630, 810],
                                             "Дезинсекция задано": [285, 385, 480, 660],
                                             "Дезинсекция выполнено": [285, 385, 630, 810],
                                             "Гигиеническая обработка задано": [345, 445, 480, 660],
                                             "Гигиеническая обработка выполнено": [345, 445, 630, 810],
                                             "Помещение в контейнер задано": [225, 325, 1240, 1420],
                                             "Помещение в контейнер выполнено": [225, 325, 1390, 1570],
                                             "Инкапсулирование задано": [285, 385, 1240, 1420],
                                             "Инкапсулирование выполнено": [285, 385, 1390, 1570],
                                             "Конвертирование задано": [345, 445, 1240, 1420],
                                             "Конвертирование выполнено": [345, 445, 1390, 1570],
                                             "Помещение в паспарту задано": [225, 325, 1995, 2175],
                                             "Помещение в паспарту выполнено": [225, 325, 2145, 2345],
                                             "Защитные элементы задано": [285, 385, 1995, 2175],
                                             "Защитные элементы выполнено": [285, 385, 2145, 2345],
                                             "Другое задано": [345, 445, 1995, 2175],
                                             "Другое выполнено": [345, 445, 2145, 2345]})
        info['list_img3'] = find_marks(image, {"Ремонт задано": [445, 545, 480, 660],
                                              "Ремонт выполнено": [445, 545, 630, 810],
                                              "Реставрация задано": [505, 605, 480, 660],
                                              "Реставрация выполнено": [505, 605, 630, 810],
                                              "Нейтрализация задано": [565, 665, 480, 660],
                                              "Нейтрализация выполнено": [565, 665, 630, 810],
                                              "Без повреждений": [630, 730, 480, 810]})
        info['mont3'] = find_marks(image, {"Ремонт задано": [445, 545, 1240, 1420],
                                           "Ремонт выполнено": [445, 545, 1390, 1570],
                                           "Замена задано": [505, 605, 1240, 1420],
                                           "Замена выполнено": [505, 605, 1390, 1570],
                                           "Без повреждений": [565, 665, 1240, 1570]})
        info['krep3'] = find_marks(image, {"Ремонт задано": [445, 545, 1995, 2175],
                                           "Ремонт выполнено": [445, 545, 2145, 2345],
                                           "Замена задано": [505, 605, 1995, 2175],
                                           "Замена выполнено": [505, 605, 2145, 2345],
                                           "Без повреждений": [565, 665, 1995, 2345]})


print(info)